### Data Management -

In [6]:
import pandas as pd
df = pd.read_csv("Cartwheeldata.csv")

In [7]:
df.head()

,ID,Age,Gender,GenderGroup,Glasses,GlassesGroup,Height,Wingspan,CWDistance,Complete,CompleteGroup,Score
0,1,56,F,1,Y,1,62.0,61.0,79,Y,1,7
1,2,26,F,1,Y,1,62.0,60.0,70,Y,1,8
2,3,33,F,1,Y,1,66.0,64.0,85,Y,1,7
3,4,39,F,1,N,0,64.0,63.0,87,Y,1,10
4,5,27,M,2,N,0,73.0,75.0,72,N,0,4

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
# to show the whole data
df

,ID,Age,Gender,GenderGroup,Glasses,GlassesGroup,Height,Wingspan,CWDistance,Complete,CompleteGroup,Score
0,1,56,F,1,Y,1,62.00,61.0,79,Y,1,7
1,2,26,F,1,Y,1,62.00,60.0,70,Y,1,8
2,3,33,F,1,Y,1,66.00,64.0,85,Y,1,7
3,4,39,F,1,N,0,64.00,63.0,87,Y,1,10
4,5,27,M,2,N,0,73.00,75.0,72,N,0,4
5,6,24,M,2,N,0,75.00,71.0,81,N,0,3
6,7,28,M,2,N,0,75.00,76.0,107,Y,1,10
7,8,22,F,1,N,0,65.00,62.0,98,Y,1,9
8,9,29,M,2,Y,1,74.00,73.0,106,N,0,5
9,10,33,F,1,Y,1,63.00,60.0,65,Y,1,8
10,11,30,M,2,Y,1,69.50,66.0,96,Y,1,6
11,12,28,F,1,Y,1,62.75,58.0,79,Y,1,10
12,13,25,F,1,Y,1,65.00,64.5,92,Y,1,6
13,14,23,F,1,N,0,61.50,57.5,66,Y,1,4
14,15,31,M,2,Y,1,73.00,74.0,72,Y,1,9
15,16,26,M,2,Y,1,71.00,72.0,115,Y,1,6
16,17,26,F,1,N,0,61.50,59.5,90,N,0,10
17,18,27,M,2,N,0,66.00,66.0,74,Y,1,5
18,19,23,M,2,Y,1,70.00,69.0,64,Y,1,3
19,20,24,F,1,Y,1,68.00,66.0,85,Y,1,8
20,21,23,M,2,Y,1,69.00,67.0,66,N,0,2
21,22,29,M,2,N,0,71.00,70.0,101,Y,1,8
22,23,25,M,2,N,0,70.00,68.0,82,Y,1,4
23,24,26,M,2,N,0,69.00,71.0,63,Y,1,5
24,25,23,F,1,Y,1,65.00,63.0,67,N,0,3

In [10]:
df.columns

Index(['ID', 'Age', 'Gender', 'GenderGroup', 'Glasses', 'GlassesGroup',
       'Height', 'Wingspan', 'CWDistance', 'Complete', 'CompleteGroup',
       'Score'],
      dtype='object')

To splice our data frame and select only specific portions of our data, there are 3 different ways of doing so.
**- .loc(),  - .iloc()  and   .ix().**

### .loc() takes 2 single/list/range operator separated by ','. The first one indicates the row and the second one indicate columns.

In [15]:
# Return all items from the column.
df.loc[:,'CWDistance']

    Age  CWDistance
0    56          79
1    26          70
2    33          85
3    39          87
4    27          72
5    24          81
6    28         107
7    22          98
8    29         106
9    33          65
10   30          96
11   28          79
12   25          92
13   23          66
14   31          72
15   26         115
16   26          90
17   27          74
18   23          64
19   24          85
20   23          66
21   29         101
22   25          82
23   26          63
24   23          67

In [16]:
# Return all items from the Multiple columns.
df.loc[:,['Age','CWDistance']]

    Age  CWDistance
0    56          79
1    26          70
2    33          85
3    39          87
4    27          72
5    24          81
6    28         107
7    22          98
8    29         106
9    33          65
10   30          96
11   28          79
12   25          92
13   23          66
14   31          72
15   26         115
16   26          90
17   27          74
18   23          64
19   24          85
20   23          66
21   29         101
22   25          82
23   26          63
24   23          67

In [17]:
# Select few rows for multiple columns. Up to 9.
df.loc[:9,['Age','Height','CWDistance']]

   Age  Height  CWDistance
0   56    62.0          79
1   26    62.0          70
2   33    66.0          85
3   39    64.0          87
4   27    73.0          72
5   24    75.0          81
6   28    75.0         107
7   22    65.0          98
8   29    74.0         106
9   33    63.0          65

In [19]:
# Select range of rows. From 10 to 15
df.loc[10:15,['Age','Height','CWDistance']]

    Age  Height  CWDistance
10   30   69.50          96
11   28   62.75          79
12   25   65.00          92
13   23   61.50          66
14   31   73.00          72
15   26   71.00         115

In [20]:
# Starting from 15
df.loc[15:,['Age','Height','CWDistance']]

    Age  Height  CWDistance
15   26    71.0         115
16   26    61.5          90
17   27    66.0          74
18   23    70.0          64
19   24    68.0          85
20   23    69.0          66
21   29    71.0         101
22   25    70.0          82
23   26    69.0          63
24   23    65.0          67

### .iloc() is integer based slicing, whereas .loc() used labels/column names.

In [21]:
# Select the first 4 rows.
df.iloc[:4]

,ID,Age,Gender,GenderGroup,Glasses,GlassesGroup,Height,Wingspan,CWDistance,Complete,CompleteGroup,Score
0,1,56,F,1,Y,1,62.0,61.0,79,Y,1,7
1,2,26,F,1,Y,1,62.0,60.0,70,Y,1,8
2,3,33,F,1,Y,1,66.0,64.0,85,Y,1,7
3,4,39,F,1,N,0,64.0,63.0,87,Y,1,10

In [22]:
# Select rows from 1 to 5 and Columns 2 to 4-1=3 ===> columns 2 and 3
df.iloc[1:5, 2:4]

  Gender  GenderGroup
1      F            1
2      F            1
3      F            1
4      M            2

In [24]:
# to view the data types of the data frame.
df.dtypes

ID                 int64
Age                int64
Gender            object
GenderGroup        int64
Glasses           object
GlassesGroup       int64
Height           float64
Wingspan         float64
CWDistance         int64
Complete          object
CompleteGroup      int64
Score              int64
dtype: object

In [25]:
###  List Unique values in the specific column.
df.Gender.unique()

array(['F', 'M'], dtype=object)

In [26]:
df.GenderGroup.unique()

array([1, 2], dtype=int64)

In [27]:
df.loc[:,['Gender','GenderGroup']]

   Gender  GenderGroup
0       F            1
1       F            1
2       F            1
3       F            1
4       M            2
5       M            2
6       M            2
7       F            1
8       M            2
9       F            1
10      M            2
11      F            1
12      F            1
13      F            1
14      M            2
15      M            2
16      F            1
17      M            2
18      M            2
19      F            1
20      M            2
21      M            2
22      M            2
23      M            2
24      F            1

In [29]:
''' When dealing with big amound of data it's  hard to check this out. 
    We can streamline this by utilizing the groupby() and size() functions . '''

df.groupby(['Gender','GenderGroup']).size()

Gender  GenderGroup
F       1              12
M       2              13
dtype: int64